In [1]:
import numpy as np
import pandas as pd

In [2]:
movies = pd.read_csv('movies.dat', sep = '::', header = None, encoding="ISO-8859-1" )
ratings = pd.read_csv('ratings.dat', sep = '::',header = None, encoding="ISO-8859-1" )

C:\Users\rs123\AppData\Local\Temp\ipykernel_9188\3593511222.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_csv('movies.dat', sep = '::', header = None, encoding="ISO-8859-1" )
C:\Users\rs123\AppData\Local\Temp\ipykernel_9188\3593511222.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  ratings = pd.read_csv('ratings.dat', sep = '::',header = None, encoding="ISO-8859-1" )

In [3]:
movies.shape, ratings.shape

((3883, 3), (1000209, 4))

In [4]:
ratings.columns = ['User_id', 'Movie_id', 'Ratings', 'Timestamp']
movies.columns = ['Movie_id', 'Title', 'Genre']

In [5]:
category  =[]
for i in range(len(movies['Genre'])):
    category.append(movies['Genre'][i].split('|'))
    
category = pd.DataFrame(category)

In [6]:
category.columns = ['category 1','category 2', 'category 3','category 4','category 5','category 6']

In [7]:
movies['category 1'] = category['category 1']
movies['category 2'] = category['category 2']

In [8]:
movies.head()

,Movie_id,Title,Genre,category 1,category 2
0,1,Toy Story (1995),Animation|Children's|Comedy,Animation,Children's
1,2,Jumanji (1995),Adventure|Children's|Fantasy,Adventure,Children's
2,3,Grumpier Old Men (1995),Comedy|Romance,Comedy,Romance
3,4,Waiting to Exhale (1995),Comedy|Drama,Comedy,Drama
4,5,Father of the Bride Part II (1995),Comedy,Comedy,None

In [9]:
movies.drop('Genre', inplace=True, axis =1)

In [10]:
movies.head()

   Movie_id                               Title category 1  category 2
0         1                    Toy Story (1995)  Animation  Children's
1         2                      Jumanji (1995)  Adventure  Children's
2         3             Grumpier Old Men (1995)     Comedy     Romance
3         4            Waiting to Exhale (1995)     Comedy       Drama
4         5  Father of the Bride Part II (1995)     Comedy        None

In [11]:
data = ratings.groupby('User_id')

In [12]:
user_1 = data.get_group(3)

In [13]:
user_1.shape

(51, 4)

In [14]:
umid = user_1['Movie_id'].tolist()

In [15]:
len(umid)

51

In [17]:
good_rate_1 = user_1[user_1['Ratings']>3]

In [18]:
data_1 = pd.merge(movies, good_rate_1, on='Movie_id') 
data_1.head()

,Movie_id,Title,category 1,category 2,User_id,Ratings,Timestamp
0,104,Happy Gilmore (1996),Comedy,None,3,4,978298486
1,260,Star Wars: Episode IV - A New Hope (1977),Action,Adventure,3,5,978297512
2,480,Jurassic Park (1993),Action,Adventure,3,4,978297690
3,552,"Three Musketeers, The (1993)",Action,Adventure,3,4,978297837
4,590,Dances with Wolves (1990),Adventure,Drama,3,4,978297439

In [19]:
c11 = pd.DataFrame(data_1['category 1'])
c21 = pd.DataFrame(data_1['category 2'])
c11.columns = ['genre']
c21.columns = ['genre']

In [20]:
Genre_1 = pd.concat([c11,c21], ignore_index = True)

In [21]:
Genre_1.head()

       genre
0     Comedy
1     Action
2     Action
3     Action
4  Adventure

In [22]:
genre_count_1 = pd.value_counts(Genre_1['genre'])
genre_count_1

Adventure     21
Action        18
Comedy        14
Drama          5
Western        2
Animation      2
Thriller       2
Children's     2
Name: genre, dtype: int64

In [23]:
top_genre_1 = max(genre_count_1.items(), key = lambda x: x[1])
top_genre_1

('Adventure', 21)

In [24]:
top_rated = ratings[(ratings['Ratings'] == 4) | (ratings['Ratings'] == 5)]

In [25]:
recMovies = movies[(movies['category 1'] == top_genre_1[0]) | (movies['category 2'] == top_genre_1[0])]

In [26]:
dataset = pd.merge(recMovies, top_rated, on='Movie_id') 
dataset.head()

,Movie_id,Title,category 1,category 2,User_id,Ratings,Timestamp
0,2,Jumanji (1995),Adventure,Children's,10,5,979168267
1,2,Jumanji (1995),Adventure,Children's,40,5,978040739
2,2,Jumanji (1995),Adventure,Children's,44,4,1004410663
3,2,Jumanji (1995),Adventure,Children's,53,5,977981548
4,2,Jumanji (1995),Adventure,Children's,60,5,977931869

In [27]:
mid1 = dataset['Movie_id']

In [28]:
mid = mid1.drop_duplicates().tolist()

In [29]:
len(mid)

274

In [30]:
dataset = pd.merge(recMovies, top_rated, on='Movie_id') 
dataset.head()

,Movie_id,Title,category 1,category 2,User_id,Ratings,Timestamp
0,2,Jumanji (1995),Adventure,Children's,10,5,979168267
1,2,Jumanji (1995),Adventure,Children's,40,5,978040739
2,2,Jumanji (1995),Adventure,Children's,44,4,1004410663
3,2,Jumanji (1995),Adventure,Children's,53,5,977981548
4,2,Jumanji (1995),Adventure,Children's,60,5,977931869

In [31]:
dataset = dataset.drop_duplicates(subset='Movie_id',)
dataset['Title'].head()

0                         Jumanji (1995)
285                  Tom and Huck (1995)
306                     GoldenEye (1995)
793              Cutthroat Island (1995)
824    City of Lost Children, The (1995)
Name: Title, dtype: object

In [32]:
dataset.shape

(274, 7)

In [33]:
dataset.head()

,Movie_id,Title,category 1,category 2,User_id,Ratings,Timestamp
0,2,Jumanji (1995),Adventure,Children's,10,5,979168267
285,8,Tom and Huck (1995),Adventure,Children's,75,5,977851520
306,10,GoldenEye (1995),Action,Adventure,18,5,978153344
793,15,Cutthroat Island (1995),Action,Adventure,103,5,977555887
824,29,"City of Lost Children, The (1995)",Adventure,Sci-Fi,5,5,978245065

In [34]:
recc = {'movie_id':[],'Movie_Name':[]}
for i in range(len(dataset['Movie_id'])):
    for j in range(len(data_1['Movie_id'])):
        if dataset['Movie_id'].iloc[i] == data_1['Movie_id'].iloc[j]:
            recc['movie_id'].append(recMovies['Movie_id'].iloc[i])
            recc['Movie_Name'].append(recMovies['Title'].iloc[i])

In [35]:
recc = pd.DataFrame(recc)

In [36]:
recc

    movie_id                                         Movie_Name
0        260          Star Wars: Episode IV - A New Hope (1977)
1        480                               Jurassic Park (1993)
2        552                       Three Musketeers, The (1993)
3        590                          Dances with Wolves (1990)
4        653                                 Dragonheart (1996)
5        733                                   Rock, The (1996)
6       1049                 Ghost and the Darkness, The (1996)
7       1127                                  Abyss, The (1989)
8       1129                        Escape from New York (1981)
9       1196  Star Wars: Episode V - The Empire Strikes Back...
10      1198                     Raiders of the Lost Ark (1981)
11      1216               Big Blue, The (Le Grand Bleu) (1988)
12      1275                                  Highlander (1986)
13      1595                    Free Willy 3: The Rescue (1997)
14      1917                                  Armageddon (1998)
15      2094                              Rocketeer, The (1991)
16      2135                             Doctor Dolittle (1967)
17      2422                         Karate Kid III, The (1989)
18      2642                                Superman III (1983)
19      2735                           Golden Child, The (1986)
20      3000      Princess Mononoke, The (Mononoke Hime) (1997)

In [37]:
recc.shape

(21, 2)